Redditclone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 2]]
---
<h2>All Posts</h2>
<% @sub.posts.each do |post|%>