Redditclone/app/controllers/posts_controller.rb

  def new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]

  def create
    # debugger
    @post = Post.new(post_params)
    @post.author_id = current_user.id
        # debugger

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "fsd"], ["url", "gdfv"], ["content", "rgfdcv"], ["author_id", 1], ["created_at", "2018-11-21 00:51:26.080902"], ["updated_at", "2018-11-21 00:51:26.080902"]]