Redditclone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "App"], ["description", "sbkcbksdbckbdksd"], ["moderator_id", 1], ["created_at", "2018-11-20 21:47:36.246908"], ["updated_at", "2018-11-20 21:47:36.246908"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find(params[:id])

UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Apprsfgxv"], ["updated_at", "2018-11-20 22:52:09.945289"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)

SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."sub_id" = $1  [["sub_id", 2]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @sub = Sub.find(params[:id])