Redditclone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "haIbrhIxJaQ58KZtyqxHlQ"], ["updated_at", "2018-11-20 19:47:46.652825"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save